app/controllers/artists_controller.rb

  def index
    @artists = Artist.all
---
SELECT * FROM "artists"

  def show
    @artist = Artist.find(params[:id])
---
SELECT * FROM "artists" WHERE ("artists"."id" = 1)

  def edit
    @artist = Artist.find(params[:id])
---
SELECT * FROM "artists" WHERE ("artists"."id" = 1)

  def create
    @artist = Artist.new(params[:artist])

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("city", "updated_at", "photo_file_name", "photo_file_size", "photo_updated_at", "photo_content_type", "phone", "first_name", "bio", "last_name", "middle_name", "email", "state", "created_at") VALUES('Miami', '2009-05-28 01:59:32', NULL, NULL, NULL, NULL, '305-572-0000', 'David', 'Born in NJ, lives and works in Miami, FL.', 'Rohn', '', 'rohndvd@bellsouth.net', 'Florida', '2009-05-28 01:59:32')

  def update
    @artist = Artist.find(params[:id])

    respond_to do |format|
      if @artist.update_attributes(params[:artist])
---
SELECT * FROM "artists" WHERE ("artists"."id" = 1)
UPDATE "artists" SET "photo_content_type" = 'image/png', "photo_file_name" = 'rails_ok.png', "photo_updated_at" = '2009-05-28 00:54:49', "photo_file_size" = 4565, "updated_at" = '2009-05-28 00:54:49' WHERE "id" = 1