app/controllers/galleries_controller.rb

  def index
    @galleries = Gallery.all
---
SELECT * FROM "galleries"

  def show
    @gallery = Gallery.find(params[:id])
---
SELECT * FROM "galleries" WHERE ("galleries"."id" = 1)

  def edit
    @gallery = Gallery.find(params[:id])
---
SELECT * FROM "galleries" WHERE ("galleries"."id" = 3)

  def create
    @gallery = Gallery.new(params[:gallery])

    respond_to do |format|
      if @gallery.save
---
INSERT INTO "galleries" ("name", "city", "zip", "updated_at", "description", "phone", "owner", "address", "state", "created_at") VALUES('Paul Kruger', 'miami', '33132', '2009-05-27 19:43:47', 'hi this is my description of the gallery', '561-213-3854', 'john', '123 home st', 'florida', '2009-05-27 19:43:47')

  def update
    @gallery = Gallery.find(params[:id])

    respond_to do |format|
      if @gallery.update_attributes(params[:gallery])
---
SELECT * FROM "galleries" WHERE ("galleries"."id" = 3)
UPDATE "galleries" SET "phone" = '305-756-2000', "zip" = '33127', "city" = 'Miami', "name" = 'Bernice Steinbaum Gallery', "state" = 'Florida', "description" = 'Work that is very narrative yet avante guard.', "address" = '3071 North Miami Avenue', "updated_at" = '2009-05-27 22:19:39', "owner" = 'Bernice Steinbaum' WHERE "id" = 1