app/controllers/museums_controller.rb

SELECT * FROM "museums"
---
  def index
    @museums = Museum.all

SELECT * FROM "museums" WHERE ("museums"."id" = 1)
---
  def show
    @museum = Museum.find(params[:id])

SELECT * FROM "museums" WHERE ("museums"."id" = 1)
---
  def edit
    @museum = Museum.find(params[:id])

INSERT INTO "museums" ("name", "city", "zip", "updated_at", "county", "description", "phone", "address", "state", "created_at") VALUES('Museum of Contemporary Art', 'North Miami', '33161', '2009-05-27 23:09:10', 'Miami-Dade', 'Contemporary Art', '305-893-6211', '770 NE 125th Street', 'Florida', '2009-05-27 23:09:10')
---
  def create
    @museum = Museum.new(params[:museum])

    respond_to do |format|
      if @museum.save

SELECT * FROM "museums" WHERE ("museums"."id" = 1)
UPDATE "museums" SET "description" = 'Contemporary Art paul', "updated_at" = '2009-05-27 23:49:50' WHERE "id" = 1
---
  def update
    @museum = Museum.find(params[:id])

    respond_to do |format|
      if @museum.update_attributes(params[:museum])